app/Controllers/Admin.php

    public function users()
    {

    if ($redirect = $this->ensureAdmin()) {
        return $redirect;

    }

    $userModel = new UserModel();
    $users = $userModel->findAll();
---
SELECT *
FROM `users`