app/Controllers/Auth.php

            // The where() and get() methods use parameterized queries internally
            // Check if user exists
            $builder = $db->table('users');
            $user = $builder->where('email', $email)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `email` = 'thorfinn@gmail.com'