app/Controllers/Course.php

    public function manage()
    {
        if ($redirect = $this->ensureCourseManager()) {
            return $redirect;
        }

        $courseModel = new CourseModel();
        $role = session()->get('role');
        $userId = session()->get('userID');

        // Get search term if provided
        $searchTerm = $this->request->getGet('search_term');

        // If teacher, only show courses assigned to them
        if ($role === 'teacher') {
            $courseModel->where('instructor_id', $userId);
        }

        // Apply search filter if provided
        if (!empty($searchTerm)) {
            $courseModel->groupStart()
                        ->like('title', $searchTerm)
                        ->orLike('course_code', $searchTerm)
                        ->orLike('description', $searchTerm)
                        ->groupEnd();
        }

        $courses = $courseModel->findAll();
---
SELECT *
FROM `courses`

        $userModel = new UserModel();
        foreach ($courses as &$course) {
            if (!empty($course['instructor_id'])) {
                $instructor = $userModel->find($course['instructor_id']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '9'